## Read in the Data

In [5]:
df <- read.csv('../../../datasets/baby-names/NationalNames2.csv')

Now that the data is read in, how would you remove the `Id` column from the dataframe in `R`. Remember, `R` is very flexible so there are several ways to remove columns. Do the following:

**Activity 1**: Remove the column `Id` from the dataframe and rename this data frame, `df`.

**Activity 2**: Find the dimensions (the number of rows and columns) of this updated data frame. *Hint: You will have to look up the function to do this as it was not mentioned in the lab*. 

**Activity 3**: Display the ***last*** 10 columns of the updated data frame.

In [1]:
#' Code for Activity 1 goes here -----------------------

In [2]:
#' Code for Activity 2 goes here -----------------------

In [3]:
#' Code for Activity 3 goes here -----------------------

Below is one of the ways that you can subset a data frame based. Run the code below to see what it returns.

In [7]:
head(df[df$Count > 2000,])

      Id    Name Year Gender Count
330  946 Charles 1880      M  5348
331  950  Thomas 1880      M  2534
985 2941   James 1881      M  5442
986 2944   Frank 1881      M  2834
987 2947  Thomas 1881      M  2282
988 2949  Robert 1881      M  2140

The bit of code only returns the first few rows of data but, in reality, there are lot more rows.

**Activity 4**: *Find out how many rows where the `Count` is greater than 2000.*

In [8]:
#' Code for Activity 4 goes here -----------------------

Now let's say that we were interested in only male names, particularly those names that are popular and not so popular.

**Activity 5**: subset the data set for rows where the gender is male and the count is above 2000 and below 100.

In [ ]:
#' Code for Activity 5 goes here -----------------------

Imagine we were interested in names during a certain time period and we didn't need any of the data for the years were were not interested in. Let's say we were interested in names from the year 1950 through 1965. Below is one way to subset based on a specific year.

In [13]:
df1950 <- head(df[df$Year == 1950,])
df1965 <- head(df[df$Year == 1965,])

comb <- rbind(df1950,df1965)

head(comb);tail(comb)

           Id    Name Year Gender Count
153876 461923    Mary 1950      F 65460
153877 461927   Nancy 1950      F 29621
153878 461928 Deborah 1950      F 29071
153879 461929  Sandra 1950      F 28893
153880 461933   Karen 1950      F 24139
153881 461938  Pamela 1950      F 16200

           Id     Name Year Gender Count
211248 633425 Patricia 1965      F 23554
211249 633427    Linda 1965      F 19339
211250 633437 Michelle 1965      F 16215
211251 633438     Lori 1965      F 15698
211252 633443   Teresa 1965      F 14578
211253 633444  Barbara 1965      F 14026

**Questions**
1. What does the `rbind` function do?
2. Describe what the code above is doing.

Well, the above code would be extremely inefficient when trying to find all of the names between the years 1950 and 1965. How might you subset the data frame based off names between the year 1950 through 1965 without subsetting each year seperately. 

**Activity 6**: *Subset the data frame based off names between the year 1950 through 1965 without subsetting each year seperately.*

In [ ]:
#' Code for Activity 6 goes here -----------------------

## A Bit of Sorting

3. Sort the dataframe based on `Count`. Then ask the students to sort dataframe based on `Name` where the names starting with Z are at the top of the dataframe.

In [17]:
head(df[order(df$Count),])

     Id      Name Year Gender Count
295 838  Adrienne 1880      F     5
296 839 Albertine 1880      F     5
297 840      Alys 1880      F     5
298 847     Celie 1880      F     5
299 851  Cordella 1880      F     5
300 852   Corrine 1880      F     5

The code above sorts the data frame based of `Count`, but we can also sort the data alphabetically off of a column of strings.

**Activity 7**: Sort the data frame based on `Name` where the names starting with "Z" are on the top of the frame.

In [ ]:
#' Code for Activity 7 goes here -----------------------

## Manipulating data with dplyr

`dplyr` makes manipulating data a bit simpler. Take a look at the code below.

In [21]:
library(dplyr)
df %>%
    filter(Name == "Linda") %>%
    arrange(-Count) %>%
    head()

      Id  Name Year Gender Count
1 482689 Linda 1952      F 67096
2 493345 Linda 1953      F 61244
3 421351 Linda 1946      F 52708
4 515139 Linda 1955      F 51275
5 537594 Linda 1957      F 44496
6 412326 Linda 1945      F 41465

**Questions**
1. Describe what the code above is doing.

There is a lot more that you can do with `dplyr` such as renaming column names.

**Activity 8**: *Copy the code above, but rename each of the columns so that the headers begin with lowercase letters. Name this data frame 'df_lower`.*

**Activity 9**: *Now, on the `df_lower` frame, remove the `gender` column.*

In [22]:
#' Code for Activity 8 goes here -----------------------

In [23]:
#' Code for Activity 9 goes here -----------------------

**Activity 10**: *Using `dplyr`, select rows based on both the names "Linda" and "John".*

In [24]:
#' Code for Activity 10 goes here -----------------------

**Challenge Activity 1**: *Use `dplyr` to find the max Count per year per name (both Linda and John).*

In [25]:
#' Code for Challenge Activity 1 goes here -----------------------